{
  "articles": [
    {
      "number": "1",
      "title": "Name and territory of the Union",
      "description": "India, that is Bharat, shall be a Union of States. The territory of India shall comprise: (a) the territories of the States; (b) the Union territories specified in the First Schedule; and (c) such other territories as may be acquired.",
      "keywords": [
        "india",
        "bharat",
        "union of states",
        "territory",
        "name"
      ],
      "category": "Union and its Territory"
    },
    {
      "number": "2",
      "title": "Admission or establishment of new States",
      "description": "Parliament may by law admit into the Union, or establish, new States on such terms and conditions as it thinks fit.",
      "keywords": [
        "new states",
        "admission",
        "establishment",
        "parliament"
      ],
      "category": "Union and its Territory"
    },
    {
      "number": "3",
      "title": "Formation of new States and alteration of areas, boundaries or names of existing States",
      "description": "Parliament may by law: (a) form a new State by separation of territory from any State or by uniting two or more States or parts of States; (b) increase the area of any State; (c) diminish the area of any State; (d) alter the boundaries of any State; (e) alter the name of any State.",
      "keywords": [
        "new states",
        "boundaries",
        "alteration",
        "formation",
        "reorganization"
      ],
      "category": "Union and its Territory"
    },
    {
      "number": "4",
      "title": "Laws made under articles 2 and 3 to provide for the amendment of the First and the Fourth Schedules",
      "description": "Any law referred to in article 2 or article 3 shall contain such provisions for the amendment of the First Schedule and the Fourth Schedule as may be necessary to give effect to the provisions of the law.",
      "keywords": [
        "schedules",
        "amendment",
        "first schedule",
        "fourth schedule"
      ],
      "category": "Union and its Territory"
    },
    {
      "number": "5",
      "title": "Citizenship at the commencement of the Constitution",
      "description": "At the commencement of this Constitution, every person who has his domicile in the territory of India and: (a) who was born in the territory of India; or (b) either of whose parents was born in the territory of India; or (c) who has been ordinarily resident in the territory of India for not less than five years immediately preceding such commencement, shall be a citizen of India.",
      "keywords": [
        "citizenship",
        "domicile",
        "commencement",
        "birth"
      ],
      "category": "Citizenship"
    },
    {
      "number": "6",
      "title": "Rights of citizenship of certain persons who have migrated to India from Pakistan",
      "description": "Notwithstanding anything in article 5, a person who has migrated to the territory of India from the territory now included in Pakistan shall be deemed to be a citizen of India if he or either of his parents or any of his grand-parents was born in India and has been ordinarily resident in the territory of India since the date of his migration.",
      "keywords": [
        "migration",
        "pakistan",
        "citizenship",
        "partition"
      ],
      "category": "Citizenship"
    },
    {
      "number": "7",
      "title": "Rights of citizenship of certain migrants to Pakistan",
      "description": "Notwithstanding anything in articles 5 and 6, a person who has after the 1st day of March, 1947, migrated from the territory of India to the territory now included in Pakistan shall not be deemed to be a citizen of India.",
      "keywords": [
        "migration",
        "pakistan",
        "citizenship"
      ],
      "category": "Citizenship"
    },
    {
      "number": "8",
      "title": "Rights of citizenship of certain persons of Indian origin residing outside India",
      "description": "Notwithstanding anything in article 5, any person who or either of whose parents or any of whose grand-parents was born in India as defined in the Government of India Act, 1935, and who is ordinarily residing in any country outside undivided India shall be deemed to be a citizen of India if he has been registered as a citizen of India.",
      "keywords": [
        "indian origin",
        "overseas",
        "citizenship",
        "NRI"
      ],
      "category": "Citizenship"
    },
    {
      "number": "9",
      "title": "Persons voluntarily acquiring citizenship of a foreign State not to be citizens",
      "description": "No person shall be a citizen of India by virtue of article 5, or be deemed to be a citizen of India by virtue of article 6 or article 8, if he has voluntarily acquired the citizenship of any foreign State.",
      "keywords": [
        "foreign citizenship",
        "voluntary acquisition",
        "dual citizenship"
      ],
      "category": "Citizenship"
    },
    {
      "number": "10",
      "title": "Continuance of the rights of citizenship",
      "description": "Every person who is or is deemed to be a citizen of India under any of the foregoing provisions of this Part shall, subject to the provisions of any law that may be made by Parliament, continue to be such citizen.",
      "keywords": [
        "continuance",
        "citizenship"
      ],
      "category": "Citizenship"
    },
    {
      "number": "11",
      "title": "Parliament to regulate the right of citizenship by law",
      "description": "Nothing in the foregoing provisions of this Part shall derogate from the power of Parliament to make any provision with respect to the acquisition and termination of citizenship and all other matters relating to citizenship.",
      "keywords": [
        "parliament",
        "citizenship law",
        "regulation"
      ],
      "category": "Citizenship"
    },
    {
      "number": "12",
      "title": "Definition of State",
      "description": "In this part, unless the context otherwise requires, the State includes the Government and Parliament of India and the Government and the Legislature of each of the States and all local or other authorities within the territory of India or under the control of the Government of India.",
      "keywords": [
        "state",
        "definition",
        "government",
        "parliament",
        "legislature"
      ],
      "category": "Fundamental Rights"
    },
    {
      "number": "13",
      "title": "Laws inconsistent with or in derogation of the fundamental rights",
      "description": "All laws in force in the territory of India immediately before the commencement of this Constitution, in so far as they are inconsistent with the provisions of this Part, shall, to the extent of such inconsistency, be void. The State shall not make any law which takes away or abridges the rights conferred by this Part and any law made in contravention of this clause shall, to the extent of the contravention, be void.",
      "keywords": [
        "laws",
        "fundamental rights",
        "void",
        "inconsistent",
        "judicial review"
      ],
      "category": "Fundamental Rights"
    },
    {
      "number": "14",
      "title": "Equality before law",
      "description": "The State shall not deny to any person equality before the law or the equal protection of the laws within the territory of India.",
      "keywords": [
        "equality",
        "equal protection",
        "law",
        "discrimination",
        "right to equality",
        "equality before law"
      ],
      "category": "Right to Equality"
    },
    {
      "number": "15",
      "title": "Prohibition of discrimination on grounds of religion, race, caste, sex or place of birth",
      "description": "The State shall not discriminate against any citizen on grounds only of religion, race, caste, sex, place of birth or any of them. No citizen shall, on grounds only of religion, race, caste, sex, place of birth or any of them, be subject to any disability, liability, restriction or condition with regard to access to shops, public restaurants, hotels and places of public entertainment.",
      "keywords": [
        "discrimination",
        "religion",
        "race",
        "caste",
        "sex",
        "equality",
        "public places"
      ],
      "category": "Right to Equality"
    },
    {
      "number": "16",
      "title": "Equality of opportunity in matters of public employment",
      "description": "There shall be equality of opportunity for all citizens in matters relating to employment or appointment to any office under the State. No citizen shall, on grounds only of religion, race, caste, sex, descent, place of birth, residence or any of them, be ineligible for, or discriminated against in respect of, any employment or office under the State.",
      "keywords": [
        "employment",
        "public service",
        "equality",
        "opportunity",
        "reservation"
      ],
      "category": "Right to Equality"
    },
    {
      "number": "17",
      "title": "Abolition of Untouchability",
      "description": "Untouchability is abolished and its practice in any form is forbidden. The enforcement of any disability arising out of Untouchability shall be an offence punishable in accordance with law.",
      "keywords": [
        "untouchability",
        "abolition",
        "social equality",
        "caste discrimination"
      ],
      "category": "Right to Equality"
    },
    {
      "number": "18",
      "title": "Abolition of titles",
      "description": "No title, not being a military or academic distinction, shall be conferred by the State. No citizen of India shall accept any title from any foreign State. No person who is not a citizen of India shall, while he holds any office of profit or trust under the State, accept without the consent of the President any title from any foreign State.",
      "keywords": [
        "titles",
        "abolition",
        "awards",
        "foreign titles"
      ],
      "category": "Right to Equality"
    },
    {
      "number": "19",
      "title": "Protection of certain rights regarding freedom of speech, etc.",
      "description": "All citizens shall have the right: (a) to freedom of speech and expression; (b) to assemble peaceably and without arms; (c) to form associations or unions or co-operative societies; (d) to move freely throughout the territory of India; (e) to reside and settle in any part of the territory of India; (f) to practice any profession, or to carry on any occupation, trade or business.",
      "keywords": [
        "freedom",
        "speech",
        "expression",
        "assembly",
        "association",
        "movement",
        "profession",
        "trade",
        "six freedoms",
        "freedom of speech",
        "freedom of assembly",
        "freedom of association",
        "freedom of movement",
        "freedom of residence",
        "freedom of profession"
      ],
      "category": "Right to Freedom"
    },
    {
      "number": "20",
      "title": "Protection in respect of conviction for offences",
      "description": "No person shall be convicted of any offence except for violation of a law in force at the time of the commission of the act charged as an offence, nor be subjected to a penalty greater than that which might have been inflicted under the law in force at the time of the commission of the offence. No person shall be prosecuted and punished for the same offence more than once. No person accused of any offence shall be compelled to be a witness against himself.",
      "keywords": [
        "conviction",
        "ex post facto",
        "double jeopardy",
        "self-incrimination",
        "criminal law"
      ],
      "category": "Right to Freedom"
    },
    {
      "number": "21",
      "title": "Protection of life and personal liberty",
      "description": "No person shall be deprived of his life or personal liberty except according to procedure established by law.",
      "keywords": [
        "life",
        "liberty",
        "personal liberty",
        "procedure",
        "law",
        "fundamental right",
        "due process",
        "right to life",
        "right to liberty",
        "life and liberty"
      ],
      "category": "Right to Freedom"
    },
    {
      "number": "21A",
      "title": "Right to education",
      "description": "The State shall provide free and compulsory education to all children of the age of six to fourteen years in such manner as the State may, by law, determine.",
      "keywords": [
        "education",
        "children",
        "free education",
        "compulsory education",
        "right to education",
        "RTE",
        "RTE act"
      ],
      "category": "Right to Education"
    },
    {
      "number": "22",
      "title": "Protection against arrest and detention in certain cases",
      "description": "No person who is arrested shall be detained in custody without being informed, as soon as may be, of the grounds for such arrest nor shall he be denied the right to consult, and to be defended by, a legal practitioner of his choice. Every person who is arrested and detained in custody shall be produced before the nearest magistrate within a period of twenty-four hours of such arrest excluding the time necessary for the journey from the place of arrest to the court of the magistrate.",
      "keywords": [
        "arrest",
        "detention",
        "custody",
        "legal practitioner",
        "magistrate",
        "habeas corpus",
        "24 hours"
      ],
      "category": "Right to Freedom"
    },
    {
      "number": "23",
      "title": "Prohibition of traffic in human beings and forced labour",
      "description": "Traffic in human beings and begar and other similar forms of forced labour are prohibited and any contravention of this provision shall be an offence punishable in accordance with law. Nothing in this article shall prevent the State from imposing compulsory service for public purposes.",
      "keywords": [
        "human trafficking",
        "forced labour",
        "begar",
        "slavery",
        "bonded labour"
      ],
      "category": "Right against Exploitation"
    },
    {
      "number": "24",
      "title": "Prohibition of employment of children in factories, etc.",
      "description": "No child below the age of fourteen years shall be employed to work in any factory or mine or engaged in any other hazardous employment.",
      "keywords": [
        "child labour",
        "children",
        "employment",
        "factory",
        "mine",
        "hazardous work"
      ],
      "category": "Right against Exploitation"
    },
    {
      "number": "25",
      "title": "Freedom of conscience and free profession, practice and propagation of religion",
      "description": "Subject to public order, morality and health and to the other provisions of this Part, all persons are equally entitled to freedom of conscience and the right freely to profess, practice and propagate religion.",
      "keywords": [
        "religion",
        "conscience",
        "freedom",
        "propagation",
        "religious freedom"
      ],
      "category": "Right to Freedom of Religion"
    },
    {
      "number": "26",
      "title": "Freedom to manage religious affairs",
      "description": "Subject to public order, morality and health, every religious denomination or any section thereof shall have the right: (a) to establish and maintain institutions for religious and charitable purposes; (b) to manage its own affairs in matters of religion; (c) to own and acquire movable and immovable property; and (d) to administer such property in accordance with law.",
      "keywords": [
        "religious affairs",
        "religious institutions",
        "property",
        "management",
        "denomination"
      ],
      "category": "Right to Freedom of Religion"
    },
    {
      "number": "27",
      "title": "Freedom as to payment of taxes for promotion of any particular religion",
      "description": "No person shall be compelled to pay any taxes, the proceeds of which are specifically appropriated in payment of expenses for the promotion or maintenance of any particular religion or religious denomination.",
      "keywords": [
        "taxes",
        "religion",
        "freedom",
        "payment",
        "secular state"
      ],
      "category": "Right to Freedom of Religion"
    },
    {
      "number": "28",
      "title": "Freedom as to attendance at religious instruction or religious worship in certain educational institutions",
      "description": "No religious instruction shall be provided in any educational institution wholly maintained out of State funds. No person attending any educational institution recognised by the State or receiving aid out of State funds shall be required to take part in any religious instruction that may be imparted in such institution or to attend any religious worship that may be conducted in such institution.",
      "keywords": [
        "religious instruction",
        "education",
        "worship",
        "freedom",
        "secular education"
      ],
      "category": "Right to Freedom of Religion"
    },
    {
      "number": "29",
      "title": "Protection of interests of minorities",
      "description": "Any section of the citizens residing in the territory of India or any part thereof having a distinct language, script or culture of its own shall have the right to conserve the same. No citizen shall be denied admission into any educational institution maintained by the State or receiving aid out of State funds on grounds only of religion, race, caste, language or any of them.",
      "keywords": [
        "minorities",
        "language",
        "script",
        "culture",
        "protection",
        "cultural rights",
        "education"
      ],
      "category": "Cultural and Educational Rights"
    },
    {
      "number": "30",
      "title": "Right of minorities to establish and administer educational institutions",
      "description": "All minorities, whether based on religion or language, shall have the right to establish and administer educational institutions of their choice. In making any law providing for the compulsory acquisition of any property of an educational institution established and administered by a minority, the State shall ensure that the amount fixed by or determined under such law for the acquisition of such property is such as would not restrict or abrogate the right guaranteed under this article.",
      "keywords": [
        "minorities",
        "educational institutions",
        "administration",
        "religious minorities",
        "linguistic minorities"
      ],
      "category": "Cultural and Educational Rights"
    },
    {
      "number": "31",
      "title": "Compulsory acquisition of property (Repealed)",
      "description": "This article dealing with the right to property was repealed by the 44th Amendment Act, 1978. The right to property is now a legal right under Article 300A, not a fundamental right.",
      "keywords": [
        "property",
        "repealed",
        "acquisition",
        "44th amendment"
      ],
      "category": "Right to Property (Repealed)"
    },
    {
      "number": "32",
      "title": "Remedies for enforcement of rights conferred by this Part",
      "description": "The right to move the Supreme Court by appropriate proceedings for the enforcement of the rights conferred by this Part is guaranteed. The Supreme Court shall have power to issue directions or orders or writs, including writs in the nature of habeas corpus, mandamus, prohibition, quo warranto and certiorari, whichever may be appropriate, for the enforcement of any of the rights conferred by this Part.",
      "keywords": [
        "supreme court",
        "remedies",
        "enforcement",
        "fundamental rights",
        "writ",
        "habeas corpus",
        "mandamus",
        "certiorari",
        "prohibition",
        "quo warranto",
        "constitutional remedies",
        "writs",
        "supreme court writs",
        "enforcement of rights"
      ],
      "category": "Right to Constitutional Remedies"
    },
    {
      "number": "33",
      "title": "Power of Parliament to modify the rights conferred by this Part in their application to Forces, etc.",
      "description": "Parliament may, by law, determine to what extent any of the rights conferred by this Part shall, in their application to the members of the Armed Forces or the Forces charged with the maintenance of public order, be restricted or abrogated so as to ensure the proper discharge of their duties and the maintenance of discipline among them.",
      "keywords": [
        "armed forces",
        "modification",
        "parliament",
        "discipline",
        "military"
      ],
      "category": "Fundamental Rights"
    },
    {
      "number": "34",
      "title": "Restriction on rights conferred by this Part while martial law is in force in any area",
      "description": "Notwithstanding anything in the foregoing provisions of this Part, Parliament may by law indemnify any person in the service of the Union or of a State or any other person in respect of any act done by him in connection with the maintenance or restoration of order in any area within the territory of India where martial law was in force.",
      "keywords": [
        "martial law",
        "restriction",
        "indemnity",
        "emergency"
      ],
      "category": "Fundamental Rights"
    },
    {
      "number": "35",
      "title": "Legislation to give effect to the provisions of this Part",
      "description": "Notwithstanding anything in this Constitution, Parliament shall have, and the Legislature of a State shall not have, power to make laws with respect to any of the matters which under clause (3) of article 16, clause (3) of article 32, article 33 and article 34 may be provided for by law made by Parliament.",
      "keywords": [
        "legislation",
        "parliament",
        "implementation",
        "fundamental rights"
      ],
      "category": "Fundamental Rights"
    },
    {
      "number": "36",
      "title": "Definition of State",
      "description": "In this Part, unless the context otherwise requires, the State has the same meaning as in Part III.",
      "keywords": [
        "state",
        "definition",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "37",
      "title": "Application of the principles contained in this Part",
      "description": "The provisions contained in this Part shall not be enforceable by any court, but the principles therein laid down are nevertheless fundamental in the governance of the country and it shall be the duty of the State to apply these principles in making laws.",
      "keywords": [
        "non-justiciable",
        "fundamental",
        "governance",
        "principles",
        "non-enforceable",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "38",
      "title": "State to secure a social order for the promotion of welfare of the people",
      "description": "The State shall strive to promote the welfare of the people by securing and protecting as effectively as it may a social order in which justice, social, economic and political, shall inform all the institutions of the national life. The State shall, in particular, strive to minimise the inequalities in income, and endeavour to eliminate inequalities in status, facilities and opportunities.",
      "keywords": [
        "social order",
        "welfare",
        "justice",
        "social justice",
        "economic justice",
        "political justice",
        "inequality",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "39",
      "title": "Certain principles of policy to be followed by the State",
      "description": "The State shall, in particular, direct its policy towards securing: (a) that the citizens, men and women equally, have the right to an adequate means of livelihood; (b) that the ownership and control of the material resources of the community are so distributed as best to subserve the common good; (c) that the operation of the economic system does not result in the concentration of wealth and means of production to the common detriment; (d) that there is equal pay for equal work for both men and women; (e) that the health and strength of workers, men and women, and the tender age of children are not abused; (f) that children are given opportunities to develop in a healthy manner.",
      "keywords": [
        "policy",
        "livelihood",
        "resources",
        "wealth distribution",
        "economic system",
        "common good",
        "equal pay",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "39A",
      "title": "Equal justice and free legal aid",
      "description": "The State shall secure that the operation of the legal system promotes justice, on a basis of equal opportunity, and shall, in particular, provide free legal aid, by suitable legislation or schemes or in any other way, to ensure that opportunities for securing justice are not denied to any citizen by reason of economic or other disabilities.",
      "keywords": [
        "equal justice",
        "free legal aid",
        "access to justice",
        "legal system",
        "legal services",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "40",
      "title": "Organisation of village panchayats",
      "description": "The State shall take steps to organise village panchayats and endow them with such powers and authority as may be necessary to enable them to function as units of self-government.",
      "keywords": [
        "panchayat",
        "village",
        "local government",
        "self-government",
        "rural",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "41",
      "title": "Right to work, to education and to public assistance in certain cases",
      "description": "The State shall, within the limits of its economic capacity and development, make effective provision for securing the right to work, to education and to public assistance in cases of unemployment, old age, sickness and disablement, and in other cases of undeserved want.",
      "keywords": [
        "work",
        "education",
        "public assistance",
        "unemployment",
        "old age",
        "social security",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "42",
      "title": "Provision for just and humane conditions of work and maternity relief",
      "description": "The State shall make provision for securing just and humane conditions of work and for maternity relief.",
      "keywords": [
        "working conditions",
        "maternity relief",
        "humane conditions",
        "labour welfare",
        "maternity benefits",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "43",
      "title": "Living wage, etc., for workers",
      "description": "The State shall endeavour to secure, by suitable legislation or economic organisation or in any other way, to all workers, agricultural, industrial or otherwise, work, a living wage, conditions of work ensuring a decent standard of life and full enjoyment of leisure and social and cultural opportunities.",
      "keywords": [
        "living wage",
        "workers",
        "decent standard",
        "leisure",
        "labour rights",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "43A",
      "title": "Participation of workers in management of industries",
      "description": "The State shall take steps, by suitable legislation or in any other way, to secure the participation of workers in the management of undertakings, establishments or other organisations engaged in any industry.",
      "keywords": [
        "workers participation",
        "management",
        "industries",
        "co-determination",
        "industrial democracy",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "43B",
      "title": "Promotion of co-operative societies",
      "description": "The State shall endeavour to promote voluntary formation, autonomous functioning, democratic control and professional management of co-operative societies.",
      "keywords": [
        "cooperative societies",
        "promotion",
        "voluntary",
        "democratic",
        "co-operatives",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "44",
      "title": "Uniform civil code for the citizens",
      "description": "The State shall endeavour to secure for the citizens a uniform civil code throughout the territory of India.",
      "keywords": [
        "uniform civil code",
        "UCC",
        "civil code",
        "citizens",
        "directive principles",
        "personal law",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "45",
      "title": "Provision for early childhood care and education to children below the age of six years",
      "description": "The State shall endeavour to provide early childhood care and education for all children until they complete the age of six years.",
      "keywords": [
        "early childhood",
        "education",
        "children",
        "care",
        "pre-primary",
        "ECCE",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "46",
      "title": "Promotion of educational and economic interests of Scheduled Castes, Scheduled Tribes and other weaker sections",
      "description": "The State shall promote with special care the educational and economic interests of the weaker sections of the people, and, in particular, of the Scheduled Castes and the Scheduled Tribes, and shall protect them from social injustice and all forms of exploitation.",
      "keywords": [
        "scheduled castes",
        "scheduled tribes",
        "weaker sections",
        "education",
        "economic interests",
        "social justice",
        "SC",
        "ST",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "47",
      "title": "Duty of the State to raise the level of nutrition and the standard of living and to improve public health",
      "description": "The State shall regard the raising of the level of nutrition and the standard of living of its people and the improvement of public health as among its primary duties and, in particular, the State shall endeavour to bring about prohibition of the consumption except for medicinal purposes of intoxicating drinks and of drugs which are injurious to health.",
      "keywords": [
        "nutrition",
        "standard of living",
        "public health",
        "prohibition",
        "health policy",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "48",
      "title": "Organisation of agriculture and animal husbandry",
      "description": "The State shall endeavour to organise agriculture and animal husbandry on modern and scientific lines and shall, in particular, take steps for preserving and improving the breeds, and prohibiting the slaughter, of cows and calves and other milch and draught cattle.",
      "keywords": [
        "agriculture",
        "animal husbandry",
        "cattle",
        "cow protection",
        "scientific farming",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "48A",
      "title": "Protection and improvement of environment and safeguarding of forests and wild life",
      "description": "The State shall endeavour to protect and improve the environment and to safeguard the forests and wild life of the country.",
      "keywords": [
        "environment",
        "forests",
        "wildlife",
        "protection",
        "ecology",
        "conservation",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "49",
      "title": "Protection of monuments and places and objects of national importance",
      "description": "It shall be the obligation of the State to protect every monument or place or object of artistic or historic interest, declared by or under law made by Parliament to be of national importance, from spoliation, disfigurement, destruction, removal, disposal or export, as the case may be.",
      "keywords": [
        "monuments",
        "heritage",
        "protection",
        "national importance",
        "cultural property",
        "ASI",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "50",
      "title": "Separation of judiciary from executive",
      "description": "The State shall take steps to separate the judiciary from the executive in the public services of the State.",
      "keywords": [
        "separation of powers",
        "judiciary",
        "executive",
        "independence",
        "judicial independence",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "51",
      "title": "Promotion of international peace and security",
      "description": "The State shall endeavour to: (a) promote international peace and security; (b) maintain just and honourable relations between nations; (c) foster respect for international law and treaty obligations in the dealings of organised peoples with one another; and (d) encourage settlement of international disputes by arbitration.",
      "keywords": [
        "international peace",
        "security",
        "foreign policy",
        "international law",
        "arbitration",
        "diplomacy",
        "directive principles",
        "DPSP",
        "directive principles of state policy",
        "state policy"
      ],
      "category": "Directive Principles"
    },
    {
      "number": "51A",
      "title": "Fundamental Duties",
      "description": "It shall be the duty of every citizen of India: (a) to abide by the Constitution and respect its ideals and institutions, the National Flag and the National Anthem; (b) to cherish and follow the noble ideals which inspired our national struggle for freedom; (c) to uphold and protect the sovereignty, unity and integrity of India; (d) to defend the country and render national service when called upon to do so; (e) to promote harmony and the spirit of common brotherhood amongst all the people of India transcending religious, linguistic and regional or sectional diversities; to renounce practices derogatory to the dignity of women; (f) to value and preserve the rich heritage of our composite culture; (g) to protect and improve the natural environment including forests, lakes, rivers and wild life, and to have compassion for living creatures; (h) to develop the scientific temper, humanism and the spirit of inquiry and reform; (i) to safeguard public property and to abjure violence; (j) to strive towards excellence in all spheres of individual and collective activity so that the nation constantly rises to higher levels of endeavour and achievement; (k) who is a parent or guardian to provide opportunities for education to his child or, as the case may be, ward between the age of six and fourteen years.",
      "keywords": [
        "fundamental duties",
        "duties",
        "citizen",
        "constitution",
        "national flag",
        "national anthem",
        "sovereignty",
        "unity",
        "integrity",
        "environment",
        "scientific temper",
        "duties of citizens",
        "citizen duties",
        "11 duties"
      ],
      "category": "Fundamental Duties"
    },
    {
      "number": "52",
      "title": "The President of India",
      "description": "There shall be a President of India.",
      "keywords": [
        "president",
        "head of state",
        "executive",
        "president of india",
        "president powers"
      ],
      "category": "Union Executive"
    },
    {
      "number": "53",
      "title": "Executive power of the Union",
      "description": "The executive power of the Union shall be vested in the President and shall be exercised by him either directly or through officers subordinate to him in accordance with this Constitution.",
      "keywords": [
        "executive power",
        "president",
        "union",
        "administration",
        "president powers",
        "presidential authority"
      ],
      "category": "Union Executive"
    },
    {
      "number": "54",
      "title": "Election of President",
      "description": "The President shall be elected by the members of an electoral college consisting of the elected members of both Houses of Parliament and the elected members of the Legislative Assemblies of the States.",
      "keywords": [
        "president",
        "election",
        "electoral college",
        "parliament",
        "state assemblies"
      ],
      "category": "Union Executive"
    },
    {
      "number": "55",
      "title": "Manner of election of President",
      "description": "The election of the President shall be held in accordance with the system of proportional representation by means of the single transferable vote and the voting at such election shall be by secret ballot.",
      "keywords": [
        "election",
        "proportional representation",
        "single transferable vote",
        "secret ballot"
      ],
      "category": "Union Executive"
    },
    {
      "number": "56",
      "title": "Term of office of President",
      "description": "The President shall hold office for a term of five years from the date on which he enters upon his office.",
      "keywords": [
        "term",
        "five years",
        "president",
        "tenure"
      ],
      "category": "Union Executive"
    },
    {
      "number": "57",
      "title": "Eligibility for re-election",
      "description": "A person who holds, or who has held, office as President shall, subject to the other provisions of this Constitution, be eligible for re-election to that office.",
      "keywords": [
        "re-election",
        "president",
        "eligibility"
      ],
      "category": "Union Executive"
    },
    {
      "number": "58",
      "title": "Qualifications for election as President",
      "description": "No person shall be eligible for election as President unless he is a citizen of India, has completed the age of thirty-five years, and is qualified for election as a member of the House of the People.",
      "keywords": [
        "qualifications",
        "president",
        "citizenship",
        "age",
        "35 years"
      ],
      "category": "Union Executive"
    },
    {
      "number": "61",
      "title": "Procedure for impeachment of the President",
      "description": "When a President is to be impeached for violation of the Constitution, the charge shall be preferred by either House of Parliament. The charge shall be passed by a majority of not less than two-thirds of the total membership of the House.",
      "keywords": [
        "impeachment",
        "president",
        "violation",
        "parliament",
        "removal"
      ],
      "category": "Union Executive"
    },
    {
      "number": "72",
      "title": "Power of President to grant pardons, etc.",
      "description": "The President shall have the power to grant pardons, reprieves, respites or remissions of punishment or to suspend, remit or commute the sentence of any person convicted of any offence.",
      "keywords": [
        "pardon",
        "reprieve",
        "remission",
        "commutation",
        "clemency",
        "mercy petition"
      ],
      "category": "Union Executive"
    },
    {
      "number": "74",
      "title": "Council of Ministers to aid and advise President",
      "description": "There shall be a Council of Ministers with the Prime Minister at the head to aid and advise the President who shall, in the exercise of his functions, act in accordance with such advice.",
      "keywords": [
        "council of ministers",
        "prime minister",
        "advice",
        "cabinet"
      ],
      "category": "Union Executive"
    },
    {
      "number": "75",
      "title": "Other provisions as to Ministers",
      "description": "The Prime Minister shall be appointed by the President and the other Ministers shall be appointed by the President on the advice of the Prime Minister. The Council of Ministers shall be collectively responsible to the House of the People.",
      "keywords": [
        "ministers",
        "prime minister",
        "appointment",
        "collective responsibility",
        "lok sabha"
      ],
      "category": "Union Executive"
    },
    {
      "number": "76",
      "title": "Attorney-General for India",
      "description": "The President shall appoint a person who is qualified to be appointed a Judge of the Supreme Court to be Attorney-General for India.",
      "keywords": [
        "attorney general",
        "legal advisor",
        "government",
        "law officer"
      ],
      "category": "Union Executive"
    },
    {
      "number": "79",
      "title": "Constitution of Parliament",
      "description": "There shall be a Parliament for the Union which shall consist of the President and two Houses to be known respectively as the Council of States and the House of the People.",
      "keywords": [
        "parliament",
        "rajya sabha",
        "lok sabha",
        "legislature",
        "bicameral"
      ],
      "category": "Parliament"
    },
    {
      "number": "80",
      "title": "Composition of the Council of States",
      "description": "The Council of States shall consist of not more than 250 members, of whom 12 shall be nominated by the President and not more than 238 shall be representatives of the States and Union territories.",
      "keywords": [
        "rajya sabha",
        "council of states",
        "upper house",
        "composition"
      ],
      "category": "Parliament"
    },
    {
      "number": "81",
      "title": "Composition of the House of the People",
      "description": "The House of the People shall consist of not more than 530 members chosen by direct election from territorial constituencies in the States, and not more than 20 members to represent the Union territories.",
      "keywords": [
        "lok sabha",
        "house of people",
        "lower house",
        "direct election",
        "composition"
      ],
      "category": "Parliament"
    },
    {
      "number": "110",
      "title": "Definition of Money Bills",
      "description": "A Bill shall be deemed to be a Money Bill if it contains only provisions dealing with taxation, borrowing of money, Consolidated Fund, or Contingency Fund of India.",
      "keywords": [
        "money bill",
        "taxation",
        "finance",
        "budget",
        "consolidated fund"
      ],
      "category": "Parliament"
    },
    {
      "number": "112",
      "title": "Annual financial statement",
      "description": "The President shall cause to be laid before both Houses of Parliament a statement of the estimated receipts and expenditure of the Government of India for that year (Budget).",
      "keywords": [
        "budget",
        "annual financial statement",
        "receipts",
        "expenditure",
        "parliament"
      ],
      "category": "Parliament"
    },
    {
      "number": "123",
      "title": "Power of President to promulgate Ordinances",
      "description": "If Parliament is not in session, the President may promulgate Ordinances which have the same force as Acts of Parliament.",
      "keywords": [
        "ordinance",
        "president",
        "emergency legislation",
        "recess"
      ],
      "category": "Parliament"
    },
    {
      "number": "124",
      "title": "Establishment and constitution of Supreme Court",
      "description": "There shall be a Supreme Court of India consisting of a Chief Justice of India and not more than 33 other Judges.",
      "keywords": [
        "supreme court",
        "chief justice",
        "judges",
        "establishment",
        "apex court",
        "highest court",
        "supreme court judges"
      ],
      "category": "Judiciary"
    },
    {
      "number": "124A",
      "title": "National Judicial Appointments Commission",
      "description": "There shall be a Commission known as the National Judicial Appointments Commission consisting of the Chief Justice of India, two senior Judges of the Supreme Court, Union Minister of Law and Justice, and two eminent persons.",
      "keywords": [
        "NJAC",
        "judicial appointments",
        "commission",
        "judges"
      ],
      "category": "Judiciary"
    },
    {
      "number": "129",
      "title": "Supreme Court to be a court of record",
      "description": "The Supreme Court shall be a court of record and shall have all the powers of such a court including the power to punish for contempt of itself.",
      "keywords": [
        "court of record",
        "contempt",
        "powers",
        "supreme court"
      ],
      "category": "Judiciary"
    },
    {
      "number": "131",
      "title": "Original jurisdiction of the Supreme Court",
      "description": "The Supreme Court shall have original jurisdiction in any dispute between the Government of India and States or between States.",
      "keywords": [
        "original jurisdiction",
        "disputes",
        "states",
        "union",
        "federal disputes",
        "supreme court jurisdiction"
      ],
      "category": "Judiciary"
    },
    {
      "number": "136",
      "title": "Special leave to appeal",
      "description": "The Supreme Court may grant special leave to appeal from any judgment, decree, determination, sentence or order in any cause or matter.",
      "keywords": [
        "special leave petition",
        "SLP",
        "appeal",
        "discretion",
        "supreme court jurisdiction"
      ],
      "category": "Judiciary"
    },
    {
      "number": "137",
      "title": "Review of judgments",
      "description": "The Supreme Court shall have power to review any judgment pronounced or order made by it.",
      "keywords": [
        "review",
        "judgment",
        "order",
        "review petition"
      ],
      "category": "Judiciary"
    },
    {
      "number": "141",
      "title": "Law declared by Supreme Court to be binding",
      "description": "The law declared by the Supreme Court shall be binding on all courts within the territory of India.",
      "keywords": [
        "binding precedent",
        "law",
        "courts",
        "stare decisis"
      ],
      "category": "Judiciary"
    },
    {
      "number": "214",
      "title": "High Courts for States",
      "description": "There shall be a High Court for each State.",
      "keywords": [
        "high court",
        "states",
        "establishment"
      ],
      "category": "Judiciary"
    },
    {
      "number": "226",
      "title": "Power of High Courts to issue writs",
      "description": "Every High Court shall have power to issue writs including habeas corpus, mandamus, prohibition, quo warranto and certiorari for enforcement of fundamental rights and for any other purpose.",
      "keywords": [
        "high court",
        "writs",
        "habeas corpus",
        "mandamus",
        "prohibition",
        "quo warranto",
        "certiorari",
        "high court writs",
        "high court jurisdiction"
      ],
      "category": "Judiciary"
    },
    {
      "number": "243",
      "title": "Definitions relating to Panchayats",
      "description": "Panchayat means an institution of self-government constituted for rural areas.",
      "keywords": [
        "panchayat",
        "definition",
        "rural",
        "local government"
      ],
      "category": "Panchayats"
    },
    {
      "number": "243G",
      "title": "Powers of Panchayats",
      "description": "The Legislature of a State may endow Panchayats with powers and authority to function as institutions of self-government.",
      "keywords": [
        "panchayat",
        "powers",
        "authority",
        "devolution",
        "self-government"
      ],
      "category": "Panchayats"
    },
    {
      "number": "243P",
      "title": "Definitions relating to Municipalities",
      "description": "Municipality means an institution of self-government constituted for urban areas.",
      "keywords": [
        "municipality",
        "definition",
        "urban",
        "local government"
      ],
      "category": "Municipalities"
    },
    {
      "number": "243W",
      "title": "Powers of Municipalities",
      "description": "The Legislature of a State may endow Municipalities with powers and authority to function as institutions of self-government.",
      "keywords": [
        "municipality",
        "powers",
        "authority",
        "urban governance"
      ],
      "category": "Municipalities"
    },
    {
      "number": "352",
      "title": "Proclamation of Emergency",
      "description": "If the President is satisfied that a grave emergency exists whereby the security of India is threatened by war, external aggression or armed rebellion, he may proclaim emergency.",
      "keywords": [
        "emergency",
        "national emergency",
        "president",
        "proclamation",
        "war",
        "armed rebellion"
      ],
      "category": "Emergency Provisions"
    },
    {
      "number": "356",
      "title": "President's Rule",
      "description": "If the President is satisfied that the government of a State cannot be carried on in accordance with the Constitution, he may assume all functions of the State government.",
      "keywords": [
        "president's rule",
        "state emergency",
        "governor",
        "constitutional machinery",
        "article 356",
        "president rule",
        "presidents rule",
        "constitutional breakdown"
      ],
      "category": "Emergency Provisions"
    },
    {
      "number": "360",
      "title": "Financial Emergency",
      "description": "If the President is satisfied that the financial stability or credit of India is threatened, he may proclaim financial emergency.",
      "keywords": [
        "financial emergency",
        "economic crisis",
        "president",
        "financial stability"
      ],
      "category": "Emergency Provisions"
    },
    {
      "number": "368",
      "title": "Power to amend the Constitution",
      "description": "Parliament may amend the Constitution by a Bill passed by each House by a majority of not less than two-thirds of members present and voting.",
      "keywords": [
        "amendment",
        "parliament",
        "constitution amendment",
        "two-thirds majority",
        "procedure"
      ],
      "category": "Amendment"
    },
    {
      "number": "371",
      "title": "Special provisions for Maharashtra and Gujarat",
      "description": "Special responsibility of the Governor for establishment of separate development boards.",
      "keywords": [
        "maharashtra",
        "gujarat",
        "special provisions",
        "development boards"
      ],
      "category": "Special Provisions"
    },
    {
      "number": "370",
      "title": "Temporary provisions with respect to the State of Jammu and Kashmir",
      "description": "Article 370 granted special autonomous status to Jammu and Kashmir. It was a 'temporary provision' that allowed J&K to have its own constitution, a separate flag, and independence over all matters except foreign affairs, defense, and communications.\n\n**Key Provisions (Before Abrogation):**\n J&K had its own constitution (adopted on 26 November 1949)\n Parliament needed the J&K government's concurrence to apply laws to the state\n Fundamental Rights under Part III applied with exceptions\n Article 35A (added via Presidential Order) gave J&K legislature power to define 'permanent residents'\n Residents of other states could not purchase property in J&K\n Separate laws for citizenship, ownership of property, and fundamental rights\n\n**Abrogation on August 5, 2019:**\n Presidential Order C.O. 272 issued under Article 370(1)(d)\n Article 370 was made inoperative except clause (1)\n All provisions of the Constitution extended to J&K\n J&K Reorganisation Act, 2019 bifurcated the state into two Union Territories:\n  - Jammu & Kashmir (with legislature)\n  - Ladakh (without legislature)\n\n**Historical Context:**\n Instrument of Accession signed by Maharaja Hari Singh on 26 October 1947\n Article 370 was drafted by Sheikh Abdullah and N. Gopalaswami Ayyangar\n Meant to be temporary but lasted 70 years\n Abrogation was challenged in Supreme Court (pending as of 2019)\n\n**Impact of Abrogation:**\n All central laws now apply to J&K\n Property rights opened to all Indian citizens\n Reservation benefits extended to previously excluded groups\n Integration with rest of India completed\n Article 35A also became inoperative",
      "keywords": [
        "jammu kashmir",
        "special status",
        "article 370",
        "abrogated",
        "temporary provisions",
        "autonomy",
        "article 35a",
        "reorganisation",
        "union territory",
        "kashmir"
      ],
      "category": "Special Provisions"
    },
    {
      "number": "35A",
      "title": "Saving of laws with respect to permanent residents and their rights",
      "description": "Article 35A was added to the Constitution through a Presidential Order in 1954 (not through constitutional amendment). It empowered the Jammu & Kashmir legislature to define 'permanent residents' of the state and provide special rights and privileges to them.\n\n**Key Features:**\n Added via Presidential Order C.O. 48 dated 14 May 1954\n Gave J&K legislature exclusive power to define permanent residents\n Permanent residents had special rights including:\n  - Right to purchase immovable property in J&K\n  - Right to employment under state government\n  - Right to scholarships and other forms of aid\n  - Right to settle and reside in the state\n\n**Controversy:**\n Never debated or voted upon in Parliament\n Added through Presidential Order, not constitutional amendment\n Challenged as unconstitutional in Supreme Court\n Discriminated against women who married non-permanent residents\n Prevented other Indian citizens from settling in J&K\n\n**Status:**\n Became inoperative along with Article 370 on August 5, 2019\n All special privileges based on permanent residency ceased\n J&K now follows same laws as rest of India",
      "keywords": [
        "article 35a",
        "permanent residents",
        "jammu kashmir",
        "special rights",
        "property rights",
        "presidential order",
        "abrogated"
      ],
      "category": "Special Provisions"
    },
    {
      "number": "300A",
      "title": "Persons not to be deprived of property save by authority of law",
      "description": "No person shall be deprived of his property save by authority of law. This article was inserted by the 44th Amendment Act, 1978, after the Right to Property was removed from the list of Fundamental Rights.\n\n**Historical Background:**\n Originally, Right to Property was a Fundamental Right under Article 31\n Article 31 was repealed by the 44th Amendment Act, 1978\n Right to Property converted from Fundamental Right to Legal/Constitutional Right\n Now protected under Article 300A in Part XII (Finance, Property, Contracts and Suits)\n\n**Significance:**\n Property can still not be taken arbitrarily\n Requires 'authority of law' - proper legal procedure must be followed\n Not a Fundamental Right, so cannot be enforced under Article 32\n Can be enforced through ordinary legal remedies\n State can acquire property for public purpose with compensation\n\n**Difference from Article 31:**\n Article 31 was a Fundamental Right - could approach Supreme Court directly\n Article 300A is a Constitutional Right - requires ordinary legal process\n Less stringent protection compared to when it was a Fundamental Right",
      "keywords": [
        "property",
        "article 300a",
        "legal right",
        "44th amendment",
        "article 31",
        "deprivation",
        "authority of law"
      ],
      "category": "Property Rights"
    },
    {
      "number": "371A",
      "title": "Special provision with respect to the State of Nagaland",
      "description": "Special provisions for Nagaland including protection of religious and social practices, customary law, and ownership of land. No Act of Parliament shall apply to Nagaland in respect of religious or social practices, customary law, and administration of civil and criminal justice unless the Legislative Assembly of Nagaland decides.\n\n**Key Provisions:**\n Religious or social practices of the Nagas protected\n Naga customary law and procedure protected\n Administration of civil and criminal justice involving Naga customary law protected\n Ownership and transfer of land and its resources protected\n Governor has special responsibility for law and order\n\n**Historical Context:**\n Added by the 13th Amendment Act, 1962\n Part of the agreement when Nagaland became a state in 1963\n Recognizes unique Naga culture and traditions",
      "keywords": [
        "nagaland",
        "special provisions",
        "customary law",
        "tribal rights",
        "article 371a",
        "naga"
      ],
      "category": "Special Provisions"
    },
    {
      "number": "371J",
      "title": "Special provisions with respect to the State of Karnataka",
      "description": "Provides for establishment of separate development boards for Hyderabad-Karnataka region. The President may by order provide for any special responsibility of the Governor for establishment of a separate development board for the Hyderabad-Karnataka region and equitable allocation of funds.\n\n**Key Features:**\n Added by the 98th Amendment Act, 2012\n Ensures balanced development of Hyderabad-Karnataka region\n Governor has special responsibility for the region\n Separate development board for the region\n Equitable allocation of funds and opportunities\n\n**Covered Region:**\n Bidar, Raichur, Gulbarga, Yadgir, Bellary, and Koppal districts",
      "keywords": [
        "karnataka",
        "hyderabad-karnataka",
        "development board",
        "special provisions",
        "article 371j",
        "regional development"
      ],
      "category": "Special Provisions"
    },
    {
      "number": "343",
      "title": "Official language of the Union",
      "description": "The official language of the Union shall be Hindi in Devanagari script. The form of numerals to be used for the official purposes of the Union shall be the international form of Indian numerals.\n\n**Key Provisions:**\n Hindi in Devanagari script is the official language\n International form of Indian numerals to be used\n For first 15 years from commencement (1950-1965), English continued for official purposes\n After 15 years, English may continue by Parliamentary law\n Official Language Act, 1963 allows continued use of English\n\n**Current Status:**\n Both Hindi and English are used for official purposes\n English continues as an associate official language\n States have their own official languages",
      "keywords": [
        "official language",
        "hindi",
        "devanagari",
        "english",
        "language policy",
        "article 343"
      ],
      "category": "Language"
    },
    {
      "number": "344",
      "title": "Commission and Committee of Parliament on official language",
      "description": "Provides for constitution of a Commission and a Committee of Parliament on official languages. The President shall constitute a Commission to make recommendations on progressive use of Hindi and restrictions on use of English.\n\n**Key Features:**\n Commission to be constituted 5 years after commencement, then every 10 years\n Commission makes recommendations on progressive use of Hindi\n Committee of Parliament (30 members) to examine Commission's recommendations\n President considers Committee's report before issuing directions",
      "keywords": [
        "language commission",
        "official language",
        "hindi",
        "parliamentary committee",
        "article 344"
      ],
      "category": "Language"
    },
    {
      "number": "351",
      "title": "Directive for development of the Hindi language",
      "description": "It shall be the duty of the Union to promote the spread of the Hindi language, to develop it so that it may serve as a medium of expression for all the elements of the composite culture of India and to secure its enrichment by assimilating the forms, style and expressions used in Hindustani and other languages of India.\n\n**Objectives:**\n Promote spread and development of Hindi\n Make Hindi a medium of expression for composite Indian culture\n Enrich Hindi by drawing from other Indian languages\n Assimilate forms, style and expressions from Hindustani and other languages",
      "keywords": [
        "hindi development",
        "language promotion",
        "composite culture",
        "article 351",
        "hindustani"
      ],
      "category": "Language"
    },
    {
      "number": "108",
      "title": "Joint sitting of both Houses in certain cases",
      "description": "If after a Bill has been passed by one House and transmitted to the other House is rejected, or the Houses have finally disagreed as to the amendments, the President may summon the Houses to meet in a joint sitting for the purpose of deliberating and voting on the Bill.",
      "keywords": [
        "joint sitting",
        "parliament",
        "deadlock",
        "president"
      ],
      "category": "Parliament"
    },
    {
      "number": "143",
      "title": "Power of President to consult Supreme Court",
      "description": "If at any time it appears to the President that a question of law or fact has arisen which is of such a nature and of such public importance that it is expedient to obtain the opinion of the Supreme Court upon it, he may refer the question to that Court for consideration.",
      "keywords": [
        "advisory jurisdiction",
        "consultation",
        "president",
        "supreme court"
      ],
      "category": "Union Judiciary"
    },
    {
      "number": "148",
      "title": "Comptroller and Auditor-General of India",
      "description": "There shall be a Comptroller and Auditor-General of India who shall be appointed by the President by warrant under his hand and seal.",
      "keywords": [
        "CAG",
        "audit",
        "accounts",
        "public finance"
      ],
      "category": "Union Executive"
    },
    {
      "number": "280",
      "title": "Finance Commission",
      "description": "The President shall, within two years from the commencement of this Constitution and thereafter at the expiration of every fifth year or at such earlier time as the President considers necessary, by order constitute a Finance Commission.",
      "keywords": [
        "finance commission",
        "tax distribution",
        "grants",
        "center-state"
      ],
      "category": "Finance"
    },
    {
      "number": "324",
      "title": "Superintendence, direction and control of elections to be vested in an Election Commission",
      "description": "The superintendence, direction and control of the preparation of the electoral rolls for, and the conduct of, all elections to Parliament and to the Legislature of every State and of elections to the offices of President and Vice-President held under this Constitution shall be vested in a Commission (Election Commission).",
      "keywords": [
        "election commission",
        "voting",
        "polls",
        "democracy"
      ],
      "category": "Elections"
    },
    {
      "number": "161",
      "title": "Power of Governor to grant pardons, etc.",
      "description": "The Governor of a State shall have the power to grant pardons, reprieves, respites or remissions of punishment or to suspend, remit or commute the sentence of any person convicted of any offence against any law relating to a matter to which the executive power of the State extends.",
      "keywords": [
        "governor",
        "pardon",
        "state",
        "mercy"
      ],
      "category": "State Executive"
    },
    {
      "number": "165",
      "title": "Advocate-General for the State",
      "description": "The Governor of each State shall appoint a person who is qualified to be appointed a Judge of a High Court to be Advocate-General for the State.",
      "keywords": [
        "advocate general",
        "legal advisor",
        "state government",
        "law officer"
      ],
      "category": "State Executive"
    },
    {
      "number": "213",
      "title": "Power of Governor to promulgate Ordinances during recess of Legislature",
      "description": "If at any time, except when the Legislative Assembly of a State is in session, the Governor is satisfied that circumstances exist which render it necessary for him to take immediate action, he may promulgate such Ordinances.",
      "keywords": [
        "ordinance",
        "governor",
        "state legislature",
        "law making"
      ],
      "category": "State Executive"
    },
    {
      "number": "262",
      "title": "Adjudication of disputes relating to waters of inter-State rivers or river valleys",
      "description": "Parliament may by law provide for the adjudication of any dispute or complaint with respect to the use, distribution or control of the waters of, or in, any inter-State river or river valley.",
      "keywords": [
        "river dispute",
        "water",
        "inter-state",
        "tribunal"
      ],
      "category": "Relations between Union and States"
    },
    {
      "number": "263",
      "title": "Provisions with respect to an inter-State Council",
      "description": "If at any time it appears to the President that the public interest would be served by the establishment of a Council charged with the duty of inquiring into and advising upon disputes which may have arisen between States.",
      "keywords": [
        "inter-state council",
        "coordination",
        "federalism",
        "center-state"
      ],
      "category": "Relations between Union and States"
    },
    {
      "number": "312",
      "title": "All-India Services",
      "description": "Parliament may by law provide for the creation of one or more all-India services (including an all-India judicial service) common to the Union and the States.",
      "keywords": [
        "IAS",
        "IPS",
        "civil services",
        "all india services"
      ],
      "category": "Services under Union and States"
    },
    {
      "number": "315",
      "title": "Public Service Commissions for the Union and for the States",
      "description": "Subject to the provisions of this article, there shall be a Public Service Commission for the Union and a Public Service Commission for each State.",
      "keywords": [
        "UPSC",
        "SPSC",
        "public service commission",
        "recruitment"
      ],
      "category": "Services under Union and States"
    },
    {
      "number": "330",
      "title": "Reservation of seats for Scheduled Castes and Scheduled Tribes in the House of the People",
      "description": "Seats shall be reserved in the House of the People for the Scheduled Castes and the Scheduled Tribes.",
      "keywords": [
        "reservation",
        "SC",
        "ST",
        "lok sabha",
        "parliament"
      ],
      "category": "Special Provisions"
    },
    {
      "number": "338",
      "title": "National Commission for Scheduled Castes",
      "description": "There shall be a Commission for the Scheduled Castes to be known as the National Commission for Scheduled Castes.",
      "keywords": [
        "NCSC",
        "scheduled castes",
        "commission",
        "rights"
      ],
      "category": "Special Provisions"
    }
  ],
  "procedures": [
    {
      "name": "Public Interest Litigation (PIL)",
      "description": "PIL is a legal action initiated for the protection of public interest. Any person can file a PIL in the Supreme Court under Article 32 or in High Courts under Article 226.",
      "procedure": "1. Draft a petition highlighting the public interest issue\n2. File in Supreme Court (Article 32) or High Court (Article 226)\n3. Court may issue notice to respondents\n4. Hearing and arguments\n5. Court passes orders/directions",
      "keywords": [
        "PIL",
        "public interest",
        "article 32",
        "article 226",
        "social justice"
      ],
      "category": "Legal Procedures"
    },
    {
      "name": "Writ Petitions",
      "description": "Writs are formal written orders issued by courts. Five types: Habeas Corpus (produce the body), Mandamus (command to perform duty), Prohibition (stop lower court), Certiorari (quash order), Quo Warranto (question authority).",
      "procedure": "1. Identify the appropriate writ type\n2. File petition in Supreme Court (Art 32) or High Court (Art 226)\n3. Court examines prima facie case\n4. Notice to respondent\n5. Final hearing and order",
      "keywords": [
        "writ",
        "habeas corpus",
        "mandamus",
        "prohibition",
        "certiorari",
        "quo warranto"
      ],
      "category": "Legal Procedures"
    },
    {
      "name": "Constitutional Amendment Procedure",
      "description": "Article 368 provides the procedure for amending the Constitution.",
      "procedure": "1. Bill introduced in either House of Parliament\n2. Passed by each House by 2/3rd majority of members present and voting\n3. For certain amendments, ratification by at least half the State Legislatures required\n4. President gives assent\n5. Amendment comes into force",
      "keywords": [
        "amendment",
        "article 368",
        "parliament",
        "ratification",
        "two-thirds majority"
      ],
      "category": "Legal Procedures"
    },
    {
      "name": "Impeachment of President",
      "description": "President can be impeached for violation of the Constitution under Article 61.",
      "procedure": "1. Charge preferred by either House with 14 days notice\n2. Resolution passed by 2/3rd majority of total membership\n3. Other House investigates the charge\n4. If charge is sustained by 2/3rd majority, President is removed",
      "keywords": [
        "impeachment",
        "president",
        "article 61",
        "removal",
        "violation"
      ],
      "category": "Legal Procedures"
    },
    {
      "name": "Filing an FIR (First Information Report)",
      "description": "An FIR is a written document prepared by police when they receive information about the commission of a cognizable offence.",
      "procedure": "1. Go to the police station having jurisdiction over the area of offence.\n2. Narrate the incident to the Officer-in-Charge or submit a written complaint.\n3. The officer MUST write it down or register it.\n4. Read the recorded information verify details and sign it.\n5. You are entitled to get a free copy of the FIR immediately.\n6. If police refuse, send complaint by post to Superintendent of Police.",
      "keywords": [
        "FIR",
        "police",
        "complaint",
        "cognizable offence",
        "crime"
      ],
      "category": "Criminal Law"
    },
    {
      "name": "Filing an RTI Application",
      "description": "Right to Information (RTI) allows citizens to request information from any public authority/government body.",
      "procedure": "1. Identify the department you need information from.\n2. Write an application (or use Form A) addressing the Public Information Officer (PIO).\n3. Clearly state the questions/information required.\n4. Pay the fee (usually Rs. 10) via IPO, Demand Draft, or Cash (free for BPL).\n5. Submit by post or online (rtionline.gov.in).\n6. The PIO must reply within 30 days (48 hours for life/liberty issues).",
      "keywords": [
        "RTI",
        "information",
        "government",
        "transparency",
        "PIO"
      ],
      "category": "Administrative Law"
    },
    {
      "name": "Filing a Consumer Complaint",
      "description": "Redressal mechanism for defective goods or deficiency in services under Consumer Protection Act, 2019.",
      "procedure": "1. Send a legal notice to the service provider/seller giving them a chance to fix the issue.\n2. If unresolved, determine jurisdiction (District/State/National) based on claim value.\n3. Files complaint (online via edaakhil.nic.in or physical).\n4. Attach transaction proofs (bills, warranty cards).\n5. No lawyer is mandatory; you can represent yourself.\n6. Pay nominal court fee.",
      "keywords": [
        "consumer court",
        "complaint",
        "defective product",
        "service deficiency",
        "compensation"
      ],
      "category": "Consumer Law"
    },
    {
      "name": "Mutual Consent Divorce",
      "description": "Fastest way to get a divorce in India under Section 13B of Hindu Marriage Act, when both parties agree.",
      "procedure": "1. Both parties file a First Motion petition in Family Court stating incompatibility.\n2. Court records statements and grants a 'Cooling-off Period' (6 months, waivable).\n3. If reconciled, petition withdrawn. If not, file Second Motion.\n4. Final hearing and decree of divorce granted.\n5. Total time: 6-18 months.",
      "keywords": [
        "divorce",
        "mutual consent",
        "family court",
        "marriage",
        "separation"
      ],
      "category": "Family Law"
    },
    {
      "name": "Cyber Crime Complaint",
      "description": "Procedure to report online frauds, harassment, or hacking.",
      "procedure": "1. Visit the National Cyber Crime Reporting Portal (cybercrime.gov.in).\n2. Register/Login using mobile number.\n3. Select category (Financial Fraud / Women & Child / Other).\n4. Provide incident details, suspect details (if any), and upload screenshots/evidence.\n5. Submit complaint. An acknowledgement number is generated.\n6. Alternatively, visit local Cyber Cell or call 1930.",
      "keywords": [
        "cyber crime",
        "hacking",
        "fraud",
        "online safety",
        "police"
      ],
      "category": "Cyber Law"
    },
    {
      "name": "Anticipatory Bail Application",
      "description": "Legal provision to seek bail in anticipation of arrest for a non-bailable offence (Section 438 CrPC/482 BNSS).",
      "procedure": "1. Contact a lawyer immediately if you fear arrest.\n2. File application in Sessions Court or High Court.\n3. Court hears the application; Public Prosecutor may oppose.\n4. If granted, police cannot arrest you (or must release on bail immediately upon formal arrest).\n5. Court may impose conditions (surrender passport, join investigation).",
      "keywords": [
        "bail",
        "arrest",
        "criminal",
        "anticipatory",
        "court"
      ],
      "category": "Criminal Law"
    },
    {
      "name": "Filing a Cheque Bounce Case",
      "description": "Procedure for legal action when a cheque is dishonoured due to insufficient funds (Section 138 NI Act).",
      "procedure": "1. Collect the 'Cheque Return Memo' from your bank.\n2. Send a Legal Notice to the drawer (issuer) within 30 days of receiving the memo, demanding payment.\n3. Give the drawer 15 days to pay.\n4. If unpaid, file a complaint in the Magistrate's Court within 30 days after the 15-day notice period expires.\n5. Submit documents: Original Cheque, Return Memo, Legal Notice copy, Proof of Delivery.",
      "keywords": [
        "cheque bounce",
        "section 138",
        "finance",
        "debt",
        "legal notice"
      ],
      "category": "Civil Law"
    },
    {
      "name": "Filing a Domestic Violence Complaint",
      "description": "Legal recourse for women facing domestic abuse under the PWDVA Act, 2005.",
      "procedure": "1. Approach a Protection Officer (PO), Police Station, or Magistrate.\n2. File a 'Domestic Incident Report' (DIR).\n3. You can seek various orders: Protection Order (stop abuse), Residence Order (right to stay in home), Monetary Relief (expenses), Custody Order (children).\n4. The Magistrate must start hearing within 3 days.\n5. Breach of a Protection Order is a criminal offence.",
      "keywords": [
        "domestic violence",
        "women safety",
        "protection order",
        "abuse",
        "dowry"
      ],
      "category": "Family Law"
    },
    {
      "name": "Marriage Registration",
      "description": "Procedure to legally register a marriage and obtain a Marriage Certificate.",
      "procedure": "1. Visit the Sub-Divisional Magistrate (SDM) office or online state portal.\n2. Fill application (Hindu Marriage Act or Special Marriage Act).\n3. Documents: Proof of Age, Address, Wedding Invitation Card, Photos of Marriage, Aadhar Cards.\n4. Both partners and 3 witnesses must appear before the registrar.\n5. Sign the register, and the certificate is issued (same day or within weeks).",
      "keywords": [
        "marriage certificate",
        "registration",
        "spouse",
        "wedding",
        "legal proof"
      ],
      "category": "Family Law"
    },
    {
      "name": "Obtaining a Succession Certificate",
      "description": "Required to inherit movable assets (bank deposits, shares) of a deceased person without a will.",
      "procedure": "1. File a petition in the District Judge's court in the jurisdiction where the deceased lived.\n2. Include details of death, family members, and assets to be claimed.\n3. The Court issues a public notice in newspapers (45 days period for objections).\n4. If no objections, the court hears the petitioner.\n5. Court asks for a bond/security and issues the Succession Certificate.",
      "keywords": [
        "inheritance",
        "succession",
        "property",
        "assets",
        "death"
      ],
      "category": "Civil Law"
    }
  ],
  "landmark_cases": [
    {
      "name": "Kesavananda Bharati v. State of Kerala (1973)",
      "year": "1973",
      "significance": "Established the Basic Structure Doctrine - Parliament cannot amend the basic structure of the Constitution.",
      "key_points": [
        "Basic Structure Doctrine",
        "Limits on amendment power",
        "Judicial review of amendments",
        "Fundamental rights protection"
      ],
      "keywords": [
        "basic structure",
        "kesavananda bharati",
        "amendment",
        "article 368"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "The Kesavananda Bharati v. State of Kerala case (1973) is a cornerstone of Indian constitutional law. It originated from a dispute over land reform laws in Kerala that restricted property management by religious institutions. Kesavananda Bharati challenged these laws, arguing they violated his fundamental rights. The case expanded to challenge constitutional amendments that asserted Parliament's unlimited power to amend the Constitution.\n\nThe 13-judge Supreme Court bench delivered a historic 7:6 verdict, establishing the 'Basic Structure Doctrine.' This doctrine states that while Parliament has the power to amend the Constitution, it cannot alter its essential features or 'basic structure,' such as the supremacy of the Constitution, the rule of law, independence of the judiciary, separation of powers, secularism, and federalism. This judgment ensured that the Constitution remains the supreme law of the land, protecting it from legislative overreach and safeguarding fundamental democratic principles."
    },
    {
      "name": "Maneka Gandhi v. Union of India (1978)",
      "year": "1978",
      "significance": "Expanded Article 21 - Right to life includes right to live with dignity. Procedure must be fair, just and reasonable.",
      "key_points": [
        "Article 21 expansion",
        "Fair procedure",
        "Right to dignity",
        "Substantive and procedural due process"
      ],
      "keywords": [
        "maneka gandhi",
        "article 21",
        "personal liberty",
        "due process"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Maneka Gandhi v. Union of India (1978) fundamentally expanded the scope of Article 21 (Right to Life and Personal Liberty). Maneka Gandhi's passport was impounded without reason, which she challenged. The Supreme Court ruled that 'personal liberty' is of wide amplitude and includes the right to travel abroad. Crucially, it established that the 'procedure established by law' to deprive someone of liberty must be 'fair, just, and reasonable,' not arbitrary. This judgment interlinked Articles 14, 19, and 21, creating a 'Golden Triangle' of fundamental rights and introducing the concept of substantive due process into Indian constitutional law."
    },
    {
      "name": "Minerva Mills v. Union of India (1980)",
      "year": "1980",
      "significance": "Struck down clauses of 42nd Amendment. Held that judicial review is part of basic structure.",
      "key_points": [
        "Judicial review",
        "Basic structure",
        "42nd Amendment",
        "Balance between rights and DPSP"
      ],
      "keywords": [
        "minerva mills",
        "basic structure",
        "judicial review",
        "amendment"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Minerva Mills v. Union of India (1980) reinforced the 'Basic Structure Doctrine.' The case challenged the 42nd Amendment, which sought to give Parliament unlimited amending power and bar judicial review. The Supreme Court struck down these provisions, declaring that Parliament cannot use its limited amending power to grant itself unlimited power. It held that Judicial Review and the balance between Fundamental Rights and Directive Principles are essential features of the Constitution's basic structure. This judgment serves as a vital check against legislative authoritarianism."
    },
    {
      "name": "SR Bommai v. Union of India (1994)",
      "year": "1994",
      "significance": "Limited misuse of Article 356 (President's Rule). Made it subject to judicial review.",
      "key_points": [
        "Article 356",
        "President's Rule",
        "Judicial review",
        "Federalism",
        "Floor test"
      ],
      "keywords": [
        "sr bommai",
        "article 356",
        "president's rule",
        "judicial review"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "S.R. Bommai v. Union of India (1994) is a landmark verdict on Center-State relations and the misuse of Article 356 (President's Rule). The Supreme Court held that the President's power to dismiss a state government is subject to judicial review and not absolute. It established that the 'floor test' in the Assembly is the only valid method to test a government's majority, ending the practice of dismissal based on subjective governor reports. The judgment also declared 'Federalism' and 'Secularism' as basic features of the Constitution, strengthening the federal structure of India."
    },
    {
      "name": "Vishaka v. State of Rajasthan (1997)",
      "year": "1997",
      "significance": "Laid down guidelines for prevention of sexual harassment at workplace.",
      "key_points": [
        "Sexual harassment",
        "Workplace safety",
        "Women's rights",
        "Vishaka guidelines"
      ],
      "keywords": [
        "vishaka",
        "sexual harassment",
        "women rights",
        "workplace"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Vishaka v. State of Rajasthan (1997) was a pioneering judgment that addressed sexual harassment at the workplace. In the absence of specific legislation, the Supreme Court stepped in to fill the legal vacuum, laying down the 'Vishaka Guidelines.' These guidelines legally defined sexual harassment and mandated employers to establish grievance redressal mechanisms, including Internal Complaints Committees. The judgment relied on international conventions (CEDAW) and declared that a safe working environment is a fundamental right under Article 21. These guidelines served as the law until the enactment of the POSH Act in 2013."
    },
    {
      "name": "NALSA v. Union of India (2014)",
      "year": "2014",
      "significance": "Recognized transgender persons as 'third gender' and granted them fundamental rights.",
      "key_points": [
        "Transgender rights",
        "Third gender",
        "Article 14, 15, 16, 21",
        "Gender identity"
      ],
      "keywords": [
        "NALSA",
        "transgender",
        "third gender",
        "LGBT rights"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "NALSA v. Union of India (2014) is a landmark judgment that recognized transgender persons as a 'third gender' and affirmed their fundamental rights under the Constitution. The Supreme Court declared that gender identity is intrinsic to one's personality and dignity, distinguishable from biological sex. The Court held that transgender individuals are entitled to the full protection of fundamental rights, including Equality (Article 14), Non-Discrimination (Articles 15 & 16), Freedom of Expression (Article 19), and Life and Liberty (Article 21). The judgment directed the government to provide affirmative action (reservations), medical facilities, and social welfare schemes for the community, marking a significant step towards gender equality and inclusion."
    },
    {
      "name": "Justice KS Puttaswamy v. Union of India (2017)",
      "year": "2017",
      "significance": "Declared Right to Privacy as a fundamental right under Article 21.",
      "key_points": [
        "Right to privacy",
        "Fundamental right",
        "Article 21",
        "9-judge bench",
        "Aadhaar case"
      ],
      "keywords": [
        "puttaswamy",
        "privacy",
        "article 21",
        "fundamental right"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Justice K.S. Puttaswamy (Retd.) v. Union of India (2017) is a landmark judgment that unanimously affirmed the Right to Privacy as a fundamental right under the Indian Constitution. The case arose from challenges to the Aadhaar project, with petitioners arguing that mandatory biometric data collection violated privacy. The Supreme Court overruled previous judgments and declared that the Right to Privacy is intrinsic to the Right to Life and Personal Liberty under Article 21 and is protected under Part III of the Constitution. The Court recognized three aspects of privacy: decisional autonomy, bodily integrity, and informational privacy. It established that any restriction on privacy must satisfy a three-part test: legality (existence of a law), legitimate state aim, and proportionality."
    },
    {
      "name": "Shreya Singhal v. Union of India (2015)",
      "year": "2015",
      "significance": "Struck down Section 66A of IT Act as unconstitutional. Protected free speech online.",
      "key_points": [
        "Section 66A",
        "Free speech",
        "Internet freedom",
        "Article 19(1)(a)",
        "IT Act"
      ],
      "keywords": [
        "shreya singhal",
        "section 66a",
        "free speech",
        "internet"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Shreya Singhal v. Union of India (2015) was a pivotal case for online free speech. It challenged Section 66A of the Information Technology Act, 2000, which criminalized sending 'offensive' or 'menacing' messages online. The provision was widely criticized for its vagueness and misuse to arrest individuals for dissenting political opinions. The Supreme Court struck down Section 66A as unconstitutional, ruling that it violated the Right to Freedom of Speech and Expression under Article 19(1)(a). The Court found the terms 'annoyance' and 'inconvenience' to be undefined and overbroad, failing to fall within the reasonable restrictions of Article 19(2). This judgment protects citizens from arbitrary arrests for online expression and reinforces the importance of clear, precise laws when restricting fundamental freedoms."
    },
    {
      "name": "Shayara Bano v. Union of India (2017)",
      "year": "2017",
      "significance": "Declared Triple Talaq (instant divorce) unconstitutional and violative of Article 14.",
      "key_points": [
        "Triple Talaq",
        "Muslim personal law",
        "Gender justice",
        "Article 14"
      ],
      "keywords": [
        "triple talaq",
        "shayara bano",
        "muslim law",
        "gender equality"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Shayara Bano v. Union of India (2017) declared the practice of instant Triple Talaq (Talaq-e-Biddat) unconstitutional. Shayara Bano, a survivor of this practice, challenged it along with polygamy and nikah halala, arguing they violated the fundamental rights of Muslim women to equality and dignity. A 5-judge Constitution Bench, in a 3:2 majority, held that instant Triple Talaq was 'manifestly arbitrary' and violative of Article 14 (Right to Equality). The Court ruled that the practice was not an essential part of Islam and could not be protected under religious freedom. This judgment was a major victory for gender justice, leading to the enactment of the Muslim Women (Protection of Rights on Marriage) Act, 2019, which criminalized the practice."
    },
    {
      "name": "Navtej Singh Johar v. Union of India (2018)",
      "year": "2018",
      "detailed_explanation": "Navtej Singh Johar v. Union of India (2018) decriminalized consensual homosexual relations between adults, striking down a colonial-era law. Section 377 of the IPC criminalized 'carnal intercourse against the order of nature,' which was used to target the LGBTQ+ community. The Supreme Court unanimously held that criminalizing consensual same-sex acts violated the fundamental rights to equality (Article 14), non-discrimination (Article 15), expression (Article 19), and life and dignity (Article 21). The Court recognized sexual orientation as an innate part of identity and apologized for the historical injustice faced by the community. This judgment was a transformative moment for LGBTQ+ rights in India, affirming equal citizenship and dignity for all.",
      "significance": "Decriminalized homosexuality by reading down Section 377 IPC.",
      "key_points": [
        "Section 377",
        "LGBT rights",
        "Decriminalization",
        "Article 14, 15, 19, 21"
      ],
      "keywords": [
        "section 377",
        "LGBT",
        "homosexuality",
        "navtej johar"
      ],
      "category": "Landmark Judgments"
    },
    {
      "name": "Indra Sawhney v. Union of India (1992)",
      "year": "1992",
      "significance": "Upheld 27% OBC reservation but capped total reservation at 50%. Excluded 'creamy layer'.",
      "key_points": [
        "Reservation cap 50%",
        "Creamy layer exclusion",
        "No reservation in promotion",
        "Article 16(4)"
      ],
      "keywords": [
        "mandal commission",
        "reservation",
        "OBC",
        "equality"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Indra Sawhney v. Union of India (1992), also known as the Mandal Commission case, is a landmark judgment on reservation in India. The 9-judge bench upheld the 27% reservation for Other Backward Classes (OBCs) in government jobs but laid down significant restrictions. It established a 50% ceiling on total reservations, ruling that reservation is an exception to the rule of equality and cannot exceed this limit. It also introduced the concept of the 'creamy layer,' excluding wealthy and socially advanced members of backward classes from reservation benefits. The court also held that reservation applies only to initial appointments and not to promotions."
    },
    {
      "name": "M.C. Mehta v. Union of India (1987)",
      "year": "1987",
      "significance": "Established 'Absolute Liability' principle for hazardous industries. Oleum Gas Leak case.",
      "key_points": [
        "Absolute liability",
        "Deep pocket theory",
        "Environmental protection",
        "Hazardous industry"
      ],
      "keywords": [
        "oleum gas",
        "environment",
        "absolute liability",
        "pollution"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "M.C. Mehta v. Union of India (1987), arising from the Oleum Gas Leak in Delhi, established the principle of 'Absolute Liability' in Indian tort law. Departing from the 19th-century English rule of 'Strict Liability' (which had exceptions), the Supreme Court held that enterprises engaged in hazardous or inherently dangerous activities are absolutely liable for any harm caused, with no exceptions or defenses. The measure of compensation must be correlated to the magnitude and capacity of the enterprise (Deep Pocket Theory) to have a deterrent effect."
    },
    {
      "name": "Common Cause v. Union of India (2018)",
      "year": "2018",
      "significance": "Legalized Passive Euthanasia and 'Living Wills'. Recognized Right to Die with Dignity.",
      "key_points": [
        "Passive euthanasia",
        "Living will",
        "Right to die with dignity",
        "Article 21"
      ],
      "keywords": [
        "euthanasia",
        "living will",
        "dignity",
        "life support"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "In Common Cause v. Union of India (2018), a 5-judge Constitution Bench recognized the 'Right to Die with Dignity' as a fundamental right under Article 21. The Court legalized 'Passive Euthanasia' (withdrawing life support for terminally ill patients) and validated 'Advance Medical Directives' or 'Living Wills,' where individuals can specify their refusal of medical treatment if they become incapacitated. The judgment distinguished passive euthanasia from active euthanasia (which remains illegal) and laid down stringent guidelines and a medical board procedure for its implementation."
    },
    {
      "name": "Joseph Shine v. Union of India (2018)",
      "year": "2018",
      "significance": "Decriminalized Adultery by striking down Section 497 IPC.",
      "key_points": [
        "Section 497",
        "Adultery",
        "Gender equality",
        "Husband not master of wife"
      ],
      "keywords": [
        "adultery",
        "decriminalization",
        "gender justice",
        "IPC"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Joseph Shine v. Union of India (2018) struck down Section 497 of the Indian Penal Code, which criminalized adultery. The law was archaic, treating women as the property of their husbands (only men could be prosecuted, and only if the husband didn't consent). The Supreme Court unanimously ruled the section unconstitutional for violating Articles 14 (Equality), 15 (Non-discrimination), and 21 (Life and Liberty). It held that 'husband is not the master of wife' and that adultery can be a ground for divorce but not a criminal offence."
    },
    {
      "name": "M Siddiq v. Mahant Suresh Das (2019)",
      "year": "2019",
      "significance": "Ayodhya Verdict. Settled the decades-old Ram Janmabhoomi-Babri Masjid land dispute.",
      "key_points": [
        "Ayodhya dispute",
        "Title suit",
        "ASI report",
        "Article 142"
      ],
      "keywords": [
        "ayodhya",
        "ram mandir",
        "babri masjid",
        "land dispute"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "The Ayodhya Verdict (2019) resolved the century-old dispute over the Ram Janmabhoomi-Babri Masjid site. A 5-judge bench unanimously awarded the disputed 2.77 acres of land to the Hindu parties for the construction of a Ram Temple, relying on archaeological evidence (ASI report) indicating a pre-existing non-Islamic structure. Using its special powers under Article 142 to ensure complete justice, the Court also directed the government to allot an alternative 5-acre plot in Ayodhya to the Sunni Waqf Board for the construction of a mosque."
    },
    {
      "name": "ADM Jabalpur v. Shivkant Shukla (1976)",
      "year": "1976",
      "significance": "The 'Habeas Corpus' case. Controversial judgment stating no right to liberty during Emergency.",
      "key_points": [
        "Habeas Corpus",
        "Emergency",
        "Right to Life suspended",
        "Darkest hour of judiciary"
      ],
      "keywords": [
        "emergency",
        "habeas corpus",
        "personal liberty",
        "detention"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "ADM Jabalpur v. Shivkant Shukla (1976) is widely regarded as the 'darkest hour' of the Indian judiciary. During the National Emergency (1975-77), the question arose whether the right to move court for a Writ of Habeas Corpus (challenging illegal detention) remained available when Fundamental Rights were suspended. In a 4:1 controversial verdict (Justice H.R. Khanna dissenting), the Supreme Court held that during an Emergency, citizens have no locus standi to move court for any enforcement of rights, even the Right to Life (Article 21). This judgment was later overruled by the Puttaswamy judgment (Privacy case) and the 44th Amendment acted to prevent Article 21 from ever being suspended again."
    },
    {
      "name": "Mohd. Ahmed Khan v. Shah Bano Begum (1985)",
      "year": "1985",
      "significance": "Upheld Muslim women's right to maintenance under CrPC. Sparked major political debate.",
      "key_points": [
        "Section 125 CrPC",
        "Maintenance",
        "Muslim Personal Law",
        "Gender justice"
      ],
      "keywords": [
        "shah bano",
        "maintenance",
        "divorce",
        "muslim women",
        "alimony"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "The Shah Bano Case (1985) was a milestone for gender justice in India. Shah Bano, a 62-year-old Muslim woman divorced by her husband, sought maintenance under Section 125 of the Code of Criminal Procedure (CrPC), a secular law applicable to all. The Supreme Court admitted her claim, ruling that CrPC overrides personal laws when they conflict on such matters. This caused a backlash from orthodox sections who saw it as interference in Muslim Personal Law. The government subsequently enacted the Muslim Women (Protection of Rights on Divorce) Act, 1986, to nullify the judgment's effect, restricting maintenance to the 'iddat' period."
    },
    {
      "name": "D.K. Basu v. State of West Bengal (1997)",
      "year": "1997",
      "significance": "Laid down guidelines for arrest and detention to prevent custodial torture.",
      "key_points": [
        "DK Basu guidelines",
        "Custodial torture",
        "Arrest memo",
        "Rights of arrestee"
      ],
      "keywords": [
        "arrest",
        "police",
        "custody",
        "human rights",
        "torture"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "D.K. Basu v. State of West Bengal (1997) addressed the growing issue of custodial deaths and police violence. The Supreme Court issued the historic 'D.K. Basu Guidelines' which the police must strictly follow during arrest and detention. These include: (1) Police personnel must bear accurate name tags; (2) An arrest memo must be prepared and attested by a witness; (3) The arrestee has a right to inform a family member/friend; (4) Inspection of body for injuries at the time of arrest; (5) Medical examination every 48 hours. Failure to comply renders the official liable for departmental action and contempt of court."
    },
    {
      "name": "Lily Thomas v. Union of India (2013)",
      "year": "2013",
      "significance": "Ruled that MPs/MLAs convicted of crimes with 2+ year sentences are immediately disqualified.",
      "key_points": [
        "Decriminalization of politics",
        "Immediate disqualification",
        "Section 8(4) RPA struck down"
      ],
      "keywords": [
        "corruption",
        "politics",
        "disqualification",
        "MP",
        "MLA"
      ],
      "category": "Landmark Judgments",
      "detailed_explanation": "Lily Thomas v. Union of India (2013) aimed to decriminalize Indian politics. The Supreme Court struck down Section 8(4) of the Representation of the People Act, 1951, which allowed convicted MPs and MLAs to retain their seats if they filed an appeal within 3 months. The Court held that Parliament had no power to enact such an exception under the Constitution. Consequently, any lawmaker convicted of a crime and sentenced to imprisonment for two years or more stands immediately disqualified from the date of conviction, losing their seat in the legislature."
    }
  ],
  "quick_replies": [
    "What is Article 21?",
    "Tell me about Right to Equality",
    "What is Article 19?",
    "Explain fundamental duties",
    "What is Article 356?",
    "What is Article 370?",
    "Tell me about Right to Education",
    "What are Directive Principles?",
    "How to file PIL?",
    "Kesavananda Bharati case",
    "Right to Privacy",
    "Triple Talaq judgment",
    "What are writs?",
    "President's powers",
    "Supreme Court jurisdiction"
  ]
}